      ******************************************************************
      *    SUMMARY‚ÌFETCH—p
      ******************************************************************
       01  FETCH-INFO.
           03 DATA-KBN                 PIC  X(01).
           03 JUCHU-YY                 PIC  9(02).
           03 JUCHU-MM                 PIC  9(02).
           03 TOKU-COD                 PIC  X(04).
           03 KINGAKU                  PIC  S9(09) PACKED-DECIMAL.
